### Series속성 읽기 
 - 인덱스 정보 읽기              ->  변수명.index
 - 값/데이터 정보 읽기           -> 변수명.values
 - 데이터 파입 정보 읽기         -> 변수명.dtype
 - 데이터 차원 정보 읽기         -> 변수명.ndim
 - 원소의 총 개수                ->  변수명.size
 - 시리즈가 비어 있는 여부 확인   -> 변수명.empty  -> 비어 있으면True /안비어 있으면False
 - 시리즈에 NaN값이 있나 없나 확인-> 변수명.hasnans->NaN 값이 있으면 True/없어면 False
 - 시리즈이름 반환 설정  ->Series.name= '변경 이름'

In [2]:
# 모듈 로딩
import pandas as pd
# 시리즈 데이터 생성
sr1=pd.Series([10,20,'30'])
print(sr1)
print(sr1.index)
print(sr1.values)
print(sr1.dtype)
print(sr1.ndim)
print(sr1.size)
print(sr1.empty)
print(sr1.name)
print(sr1.hasnans)

0    10
1    20
2    30
dtype: object
RangeIndex(start=0, stop=3, step=1)
[10 20 '30']
object
1
3
False
None
False

In [3]:
import pandas as pd
#데이타 준비
data1=['A','B','C']
data2={"name":'Hong','age':10}
data3=['A','B','C'],{"name":'Hong','age':10}
# 시리즈 객체 생성

sr1=pd.Series(data1)
sr2=pd.Series(data2)
sr3=pd.Series(data3)

In [17]:
sr1

0    A
1    B
2    C
dtype: object

In [18]:
sr2

name    Hong
age       10
dtype: object

In [5]:
sr3

0                      [A, B, C]
1    {'name': 'Hong', 'age': 10}
dtype: object

In [20]:
#리스트 데이터 생성도니 시리즈 객체 속성 확인
print('index :' ,sr1.index)
print('values :',sr1.values)
print('dtype :', sr1.dtype)
print('ndim: ',sr1.ndim)

index : RangeIndex(start=0, stop=3, step=1)
values : ['A' 'B' 'C']
dtype : object
ndim:  1

In [6]:
import pandas as pd

In [7]:
jumsu=[98,99,100],[47,81,88]
print(jumsu)

([98, 99, 100], [47, 81, 88])

In [8]:
jumsu=pd.DataFrame(jumsu)
pd.DataFrame

pandas.core.frame.DataFrame

In [9]:
print(jumsu)

    0   1    2
0  98  99  100
1  47  81   88

In [10]:
data = {
    'Name': ['철수', '영희', '민수'],
    'Age': [25, 30, 35],
    'Gender': ['남', '여', '남']
}

In [11]:
df = pd.DataFrame(data)
df

  Name  Age Gender
0   철수   25      남
1   영희   30      여
2   민수   35      남

In [12]:
df.columns = ['Full Name', 'Age', 'Location']
df

  Full Name  Age Location
0        철수   25        남
1        영희   30        여
2        민수   35        남

In [13]:

df.columns = ['Full Name', 'Age', 'Location']

df

  Full Name  Age Location
0        철수   25        남
1        영희   30        여
2        민수   35        남

In [14]:
df.index = ['사람1', '사람2', '사람3']
df

    Full Name  Age Location
사람1        철수   25        남
사람2        영희   30        여
사람3        민수   35        남

In [15]:
# 예제 데이터프레임 생성
data = {
    'Name': ['철수', '영희', '민수'],
    'Age': [25, 30, 35],
    'Gender': ['남', '여', '남']
}

df = pd.DataFrame(data)

# 열 순서 변경
df = df[['Age', 'Name', 'Gender']]

print(df)

   Age Name Gender
0   25   철수      남
1   30   영희      여
2   35   민수      남

In [16]:
import pandas as pd
import pandas as pd

#데이터 준비
jumsu={'국어':[89,91],'수학':[88,90], '음악':[100,98]}

#DF으로 데이터 저장

df1=pd.DataFrame(jumsu)

# 데이터 확인
print(df1)

   국어  수학   음악
0  89  88  100
1  91  90   98